using System;
//Во время разработки некоторой задачи Саша решил сгенерировать несколько новых тестов. Каждый тест Саши должен представлять собой натуральное число, не меньшее ﻿﻿ll﻿﻿ и не большее ﻿﻿rr﻿﻿. Кроме того, натуральное число в тесте обязательно должно состоять из одинаковых цифр.

//Например, число ﻿﻿999999﻿﻿ подходит под это требование, а число ﻿﻿123123﻿﻿ — нет. Какое максимальное число различных тестов сможет создать Саша?



//Формат входных данных 

//В единственной строке вводятся два натуральных числа ﻿﻿l, r l, r﻿﻿  (1 \leq l, r \leq 10 ^{18})(1≤l,r≤10
//18
// )﻿﻿— ограничения на тесты Саши.

//Обратите внимания, что эти числа не вместятся в ﻿﻿3232﻿﻿-битный тип данных, используйте ﻿﻿6464﻿﻿-битный при необходимости



//Формат выходных данных

//Выведите одно число — количество тестов, которое может сделать Саша.

namespace _005_Contest
{
    internal class Program
    {
        static void Main()
        {
        }
    }
}
